Examinator/src/Catalogs/СводыЗнанийСУЗ/СводыЗнанийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СводыЗнанийСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>РуководствоПользователя</name>
      <description>Руководство пользователя</description>
    </items>
  </predefined>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартоваяСтраница</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьПоставщика</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыЭлектронныхРесурсовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательнаяНавигация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьСодержание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Глоссарий</name>
    <type>
      <types>CatalogRef.ГлоссарииСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочнаяИнформация</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Базовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПервуюСсылкуНаТермин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТерминВсплывающейПодсказкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьНепройденное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПользовательскиеНастройки</name>
    <attributes>
      <name>ВидНастройки</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыНастроекЭлектронныхРесурсовСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыгружатьПриОткрытии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.ТерминыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/InformationRegisters/ГруппыОбъектовСУЗ/ГруппыОбъектовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГруппыОбъектовСУЗ</name>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
      <types>CatalogRef.ГлоссарииСУЗ</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Группа</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
      <types>CatalogRef.ТерминыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.ГлоссарииСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.ВопросыСУЗ</types>
      <types>CatalogRef.РубрикаторыСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДанныеВебКабинетаСУЗ_ПН/ДанныеВебКабинетаСУЗ_ПН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеВебКабинетаСУЗ_ПН</name>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Формат</name>
    <type>
      <types>EnumRef.ФорматыВебДанныхСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыДанныхВебКабинетаСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ПользователиВебКабинетаСУ/ПользователиВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПользователиВебКабинетаСУ</name>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СохраняемоеЗначениеПароля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Права</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/ТипыОбъектовСУЗ/ТипыОбъектовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбъектовСУЗ</name>
  <enumValues>
    <name>collection</name>
  </enumValues>
  <enumValues>
    <name>file</name>
  </enumValues>
  <enumValues>
    <name>frame</name>
  </enumValues>
  <enumValues>
    <name>glossary</name>
  </enumValues>
  <enumValues>
    <name>knowledgeBase</name>
  </enumValues>
  <enumValues>
    <name>map</name>
  </enumValues>
  <enumValues>
    <name>page</name>
  </enumValues>
  <enumValues>
    <name>question</name>
  </enumValues>
  <enumValues>
    <name>res</name>
  </enumValues>
  <enumValues>
    <name>term</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыЭлектронныхРесурсовСУЗ/ТипыЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЭлектронныхРесурсовСУЗ</name>
  <enumValues>
    <name>Тест</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныйКурс</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыФайловСУЗ/ТипыФайловСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыФайловСУЗ</name>
  <enumValues>
    <name>Default</name>
  </enumValues>
  <enumValues>
    <name>Folder</name>
  </enumValues>
  <enumValues>
    <name>Media</name>
  </enumValues>
  <enumValues>
    <name>Image</name>
  </enumValues>
  <enumValues>
    <name>Video</name>
  </enumValues>
  <enumValues>
    <name>Audio</name>
  </enumValues>
  <enumValues>
    <name>Document</name>
  </enumValues>
  <enumValues>
    <name>DataProcessor</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/НазначенияТестированийСУЗ/НазначенияТестированийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НазначенияТестированийСУЗ</name>
  <enumValues>
    <name>Аттестация</name>
  </enumValues>
  <enumValues>
    <name>Упражнение</name>
  </enumValues>
  <enumValues>
    <name>Анкетирование</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыДанныхВебКабинетаСУЗ/ТипыДанныхВебКабинетаСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДанныхВебКабинетаСУЗ</name>
  <enumValues>
    <name>КаталогЭлектронныхРесурсов</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ФорматыВебДанныхСУ/ФорматыВебДанныхСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФорматыВебДанныхСУ</name>
  <enumValues>
    <name>xml</name>
  </enumValues>
  <enumValues>
    <name>json</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/СводыЗнанийСУЗ/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
Функция ТипОбъектаСУЗ() Экспорт
	
	Возврат Перечисления.ТипыОбъектовСУЗ.knowledgeBase;
	
КонецФункции

Функция ПолучитьXMLПредставление(Ссылка, ПараметрыСсылки, КонтекстВыполнения) Экспорт
	
	СводЗнанийXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/KnowledgeBase", "СводЗнаний");
	СводЗнанийXDTO     = ФабрикаXDTO.Создать(СводЗнанийXDTOТип);
	
    СводЗнанийXDTO.id  = Ссылка.УникальныйИдентификатор();
	
	ИмяОбъектаСУЗ         = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ТипОбъектаСУЗ());
	СводЗнанийXDTO.object = ИмяОбъектаСУЗ;
    СводЗнанийXDTO.Наименование = Ссылка.Наименование;
	
	// ПоследняяВерсия = ПолучитьПоследнююВерсиюОбъектаСУЗ(ЭтотОбъект);
	
	// СводЗнанийXDTO.Версия   = Строка(ПоследняяВерсия.Версия);
	// СводЗнанийXDTO.Редакция = Строка(Редакция);
	СводЗнанийXDTO.Версия   = Ссылка.Версия;
	СводЗнанийXDTO.Редакция = Ссылка.Редакция;
	
	СводЗнанийXDTO.ЭтоБазоваяКонфигурация = ОбщегоНазначенияСУ.ЭтоБазоваяВерсияКонфигурации();
	
	ОбъектСУЗXDTOТип  = ФабрикаXDTO.Тип("http://v8.1c.ru/kms/1/KnowledgeSources", "ОбъектСУЗ");
	
	Если ЗначениеЗаполнено(Ссылка.Карта) Тогда
		
		КартаXDTO = ФабрикаXDTO.Создать(ОбъектСУЗXDTOТип);
		КартаXDTO.object = "map";
		КартаXDTO.id = Ссылка.Карта.УникальныйИдентификатор();;
		
		СводЗнанийXDTO.Карта = КартаXDTO;
			
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка.СтартоваяСтраница) Тогда
		
		Если ТипЗнч(Ссылка.СтартоваяСтраница) = Тип("СправочникСсылка.КартыСУЗ") Тогда
			
			ПараметрыСсылки.Вставить("idTargetMap", Строка(Ссылка.УникальныйИдентификатор()));
			ПараметрыСсылки.Вставить("targetMap", "KnowledgeBase");
			ПараметрыСсылки.Вставить("view", "children");
			
		КонецЕсли;
		
		
		СтруктураДанныхСтраницы = ОбъектыСУЗ.ПолучитьПредставление(Ссылка.СтартоваяСтраница, ПараметрыСсылки, КонтекстВыполнения);
		
		СтартоваяСтраницаXDTO = ФабрикаXDTO.Создать(ОбъектСУЗXDTOТип);
		СтартоваяСтраницаXDTO.Представление = СтруктураДанныхСтраницы.Представление;
		СтартоваяСтраницаXDTO.Скрипт = СтруктураДанныхСтраницы.Скрипт;
		
		СводЗнанийXDTO.СтартоваяСтраница = СтартоваяСтраницаXDTO;
	
	КонецЕсли;
	
	ШаблонОбъекта = ОбъектыСУЗ.ПолучитьСсылкуНаXSLШаблонОбъекта(Ссылка);
	ОбъектыСУЗ.ДобавитьШаблонВСписокОбъекта(ШаблонОбъекта, КонтекстВыполнения.СписокШаблонов);
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, СводЗнанийXDTO);
	XMLДанные = ЗаписьXML.Закрыть();
	
	ОбъектыСУЗ.ДобавитьСсылкиОбъектаВМассив(Ссылка, КонтекстВыполнения);
	
	Возврат XMLДанные;
	
КонецФункции

// Функция служит для определения идентификатора свода знаний,
// который используется для формирования каталога хранения ресурсов свода знаний.
//
// Параметры:
//  ЭлементСодержания - ссылка на элемент справочника СводыЗнанийСУЗ или СодержаниеСУЗ.
//
// Возвращаемое значение:
//  Строка.
//
Функция ИдентификаторКаталога(ЭлементСодержания) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЭлементСодержания) Тогда
		
		Возврат "common";
		
	Иначе
		
		Если ТипЗнч(ЭлементСодержания) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
			СводЗнаний = ЭлементСодержания;
		Иначе
			СводЗнаний = ЭлементСодержания.Владелец;
		КонецЕсли;
		
		ДанныеСводаЗнаний = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СводЗнаний, "Идентификатор, ПоказыватьПоследнююВерсию");
		
		Если НЕ ДанныеСводаЗнаний.ПоказыватьПоследнююВерсию Тогда
			Возврат "common";	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеСводаЗнаний.Идентификатор) Тогда
			
			Возврат СокрЛП(ДанныеСводаЗнаний.Идентификатор);
			
		Иначе
			
			Возврат Строка(СводЗнаний.УникальныйИдентификатор());
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

// Функция служит для определения поставщика свода знаний,
// в контексте которого воспроизводится объект.
//
// Параметры:
//  ЭлементСодержания - ссылка на элемент справочника СводыЗнанийСУЗ или СодержаниеСУЗ.
//
// Возвращаемое значение:
//  Ссылка на элемент справочника ПоставщикиСУЗ
//
Функция Поставщик(ЭлементСодержания) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЭлементСодержания) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(ЭлементСодержания) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
		СводЗнаний = ЭлементСодержания;
	Иначе
		СводЗнаний = ЭлементСодержания.Владелец;
	КонецЕсли;
	
	Если НЕ СводЗнаний.ПоказыватьПоследнююВерсию Тогда
		Возврат Неопределено;
	Иначе
		Возврат СводЗнаний.ПредпочитатьПоставщика;
	КонецЕсли;
	
КонецФункции

// Возвращает группу нужного типа, в которую будут помещаться элементы электронного ресурса.
//
Функция ГруппаДляХраненияПодчиненныхЭлементов(Знач ЭлектронныйРесурс, Знач ТипПодчиненногоЭлемента) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЭлектронныйРесурс)
		ИЛИ НЕ ЗначениеЗаполнено(ТипПодчиненногоЭлемента) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	ГруппаПодчиненныхЭлементов = РегистрыСведений.ГруппыОбъектовСУЗ.ГруппаДляХраненияПодчиненныхЭлементов(ЭлектронныйРесурс, ТипПодчиненногоЭлемента);
	
	Если ГруппаПодчиненныхЭлементов = Неопределено Тогда
		
		ИмяСправочника = Метаданные.НайтиПоТипу(ТипПодчиненногоЭлемента).Имя;
		
		НоваяГруппаОбъект =  Справочники[ИмяСправочника].СоздатьГруппу();
		НоваяГруппаОбъект.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлектронныйРесурс, "Наименование");
		
		РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(НоваяГруппаОбъект);

		НоваяГруппаОбъект.Записать();
		
		ГруппаПодчиненныхЭлементов = НоваяГруппаОбъект.Ссылка;
		
		РегистрыСведений.ГруппыОбъектовСУЗ.СохранитьГруппуДляХраненияПодчиненныхЭлементов(ЭлектронныйРесурс, ГруппаПодчиненныхЭлементов);
		
	КонецЕсли;
	
	Возврат ГруппаПодчиненныхЭлементов;
	
КонецФункции

// Возвращает элемент справочника "ПодборкиСУЗ",
// который прикреплен к электронному ресурсу, как единственный тест.
//
Функция Тест(ЭлектронныйРесурс) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЭлектронныйРесурс) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлектронныйРесурс, "Тип") <> Перечисления.ТипыЭлектронныхРесурсовСУЗ.Тест Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СодержаниеСУЗ.СсылкаНаЭлемент
		|ИЗ
		|	Справочник.СодержаниеСУЗ КАК СодержаниеСУЗ
		|ГДЕ
		|	СодержаниеСУЗ.Владелец = &ЭлектронныйРесурс
		|	И СодержаниеСУЗ.ЭтоГруппа = ЛОЖЬ
		|	И СодержаниеСУЗ.ПометкаУдаления = ЛОЖЬ
		|	И ТИПЗНАЧЕНИЯ(СодержаниеСУЗ.СсылкаНаЭлемент) = ТИП(Справочник.ПодборкиСУЗ)";

	Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);

	Результат = Запрос.Выполнить();

	Если НЕ Результат.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
			
			ВыборкаДетальныеЗаписи.Следующий();
			
			Возврат ВыборкаДетальныеЗаписи.СсылкаНаЭлемент;
			
		КонецЕсли;

	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Добавляет элемент в содержание электронного ресурса
//
Функция ДобавитьЭлементСодержания(ЭлектронныйРесурс, СсылкаНаЭлемент, Группа, ЭтоГруппа = Ложь, Наименование = Неопределено) Экспорт
	
	Если ЭтоГруппа Тогда
		ЭлементСодержанияОбъект = Справочники.СодержаниеСУЗ.СоздатьГруппу();
	Иначе
		ЭлементСодержанияОбъект = Справочники.СодержаниеСУЗ.СоздатьЭлемент();
    КонецЕсли;
	
	Если Наименование = Неопределено И ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
		
		ЭлементСодержанияОбъект.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаЭлемент, "Наименование");
		
	Иначе
		
		ЭлементСодержанияОбъект.Наименование = Наименование;
		
		Если НЕ ЭтоГруппа Тогда
			ЭлементСодержанияОбъект.РазрешитьРедактироватьНаименование = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	ЭлементСодержанияОбъект.Владелец        = ЭлектронныйРесурс;
	
	Если ЗначениеЗаполнено(СсылкаНаЭлемент)
		И НЕ ЭтоГруппа Тогда
		
		ЭлементСодержанияОбъект.СсылкаНаЭлемент = СсылкаНаЭлемент;
		
	КонецЕсли;

	ЭлементСодержанияОбъект.Родитель        = Группа;
	
	РазработкаСУЗ.УстановитьПредпочитаемогоПоставщика(ЭлементСодержанияОбъект);
	
	
	ЭлементСодержанияОбъект.ДополнительныеСвойства.Вставить("ПроверитьНаДубликат", Истина);
	ЭлементСодержанияОбъект.Записать();
	
	Возврат ЭлементСодержанияОбъект.Ссылка;
	
КонецФункции

// Возвращает элемент содержания электронного ресурса,
// если он единственный. Иначе возвращает Неопределено.
//
Функция ЕдинственныйЭлементСодержания(ЭлектронныйРесурс) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СодержаниеСУЗ.Ссылка
		|ИЗ
		|	Справочник.СодержаниеСУЗ КАК СодержаниеСУЗ
		|ГДЕ
		|	СодержаниеСУЗ.ЭтоГруппа = ЛОЖЬ
		|	И СодержаниеСУЗ.ПометкаУдаления = ЛОЖЬ
		|	И СодержаниеСУЗ.Владелец = &ЭлектронныйРесурс";

	Запрос.УстановитьПараметр("ЭлектронныйРесурс", ЭлектронныйРесурс);

	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
			
			ВыборкаДетальныеЗаписи.Следующий();
			
			Возврат ВыборкаДетальныеЗаписи.Ссылка;
			
		Иначе
			
			Возврат Неопределено;
			
		КонецЕсли;
			
	КонецЕсли;
	
КонецФункции

// Возвращает ресурс из списка СкрытыеРесурсы, форма которого следует открывать для реадактирования.
//
// Примечание: получение ресурсов необходимо, так как в скрытых ресурсах могут хранится
// ссылки на общие объекты, например, подборки, которые содержат по одному элементу
// или вообще только скрытые ресурсы. Поэтому редактирование самих ресурсов неудобно -
// следует заглянуть внутрь его и открывать конечный ресурс пользователю.
// Такая ситуация связана с тем, что загрузка файлов через форму "ФормаИмпортаФайлов"
// выполняется единообразно, как для обычных, так и для скрытых, из-за этого
// скрытый ресурс может оказаться обернутым в несколько объектов.
//
Функция СкрытыйРесурсДляРедактирования(Ресурс) Экспорт
	
	Если ТипЗнч(Ресурс) = Тип("СправочникСсылка.РесурсыСУЗ") Тогда
		
		ЕдинственныйЭлемент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ресурс, "ЕдинственныйФайл");
		
		Если ЗначениеЗаполнено(ЕдинственныйЭлемент) Тогда
			Возврат СкрытыйРесурсДляРедактирования(ЕдинственныйЭлемент); // Рекурсия
		Иначе
			Возврат Ресурс;
		КонецЕсли;		
		
	ИначеЕсли ТипЗнч(Ресурс) = Тип("СправочникСсылка.ПодборкиСУЗ") Тогда
		
		ЕдинственныйЭлемент = Справочники.ПодборкиСУЗ.ЕдинственныйЭлементПодборки(Ресурс, Истина);
		
		Если ЗначениеЗаполнено(ЕдинственныйЭлемент) Тогда
			Возврат СкрытыйРесурсДляРедактирования(ЕдинственныйЭлемент);  // Рекурсия
		Иначе
			Возврат Ресурс;
		КонецЕсли;
		
	Иначе		
		
		Возврат Ресурс;
		
	КонецЕсли;	
	
КонецФункции

Функция ТипСкрытогоРесурсаДляРедактирования(РесурсДляРедактирования) Экспорт
	
	Если ТипЗнч(РесурсДляРедактирования) = Тип("СправочникСсылка.ФайлыСУЗ") Тогда
		
		ТипФайла = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РесурсДляРедактирования, "ТипФайла");
		
		Если ТипФайла = Перечисления.ТипыФайловСУЗ.Default Тогда
			Возврат НСТр("ru = 'Файл'");
		Иначе
			Возврат Строка(ТипФайла);
		КонецЕсли;		
		
	ИначеЕсли ТипЗнч(РесурсДляРедактирования) = Тип("СправочникСсылка.ПодборкиСУЗ") Тогда
		
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РесурсДляРедактирования, "ЭтоТест") Тогда
			Возврат НСтр("ru = 'Тест'");
		Иначе
			Возврат НСтр("ru = 'Теория'");
		КонецЕсли;			
		
	Иначе
		
		Возврат Строка(ТипЗнч(РесурсДляРедактирования));
		
	КонецЕсли;
	
	
КонецФункции

Функция СкрытыйРесурсДляПросмотра(Ресурс) Экспорт
	
	Если ТипЗнч(Ресурс) = Тип("СправочникСсылка.ПодборкиСУЗ") Тогда
		
		// Примечание: это работает, пока в скрытые ресурсы нельзя добавлять
		// теорию вручную, а только через форму загрузки файлов. Так как
		// если добавлять теорию с одним элементом, то она может иметь свои настройки,
		// который будет ожидать увидеть пользователь.		
		
		ЕдинственныйЭлемент = Справочники.ПодборкиСУЗ.ЕдинственныйЭлементПодборки(Ресурс, Истина);
		
		Если ЗначениеЗаполнено(ЕдинственныйЭлемент) Тогда
			Возврат СкрытыйРесурсДляПросмотра(ЕдинственныйЭлемент);  // Рекурсия
		Иначе
			Возврат Ресурс;
		КонецЕсли;		
		
	Иначе
		
		Возврат Ресурс;
		
	КонецЕсли;
	
КонецФункции

Функция ВыставляетсяОценка(Знач ЭлектронныйРесурс) Экспорт
	
	МассивЭлектронныхРесурсов = Новый Массив;
	МассивЭлектронныхРесурсов.Добавить(ЭлектронныйРесурс);
	
	ТаблицаЭлектронныхРесурсов = ТаблицаВыставляетсяОценка(МассивЭлектронныхРесурсов);
	
	Возврат ТаблицаЭлектронныхРесурсов[0].ВыставляетсяОценка;
	
КонецФункции

Функция ТаблицаВыставляетсяОценка(МассивЭлектронныхРесурсов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА СодержаниеСУЗ.СсылкаНаЭлемент ССЫЛКА Справочник.ПодборкиСУЗ
		|			ТОГДА ВЫРАЗИТЬ(СодержаниеСУЗ.СсылкаНаЭлемент КАК Справочник.ПодборкиСУЗ).НазначениеТестирования
		|	КОНЕЦ КАК НазначениеТестирования,
		|	ВЫБОР
		|		КОГДА СодержаниеСУЗ.СсылкаНаЭлемент ССЫЛКА Справочник.ПодборкиСУЗ
		|			ТОГДА ВЫРАЗИТЬ(СодержаниеСУЗ.СсылкаНаЭлемент КАК Справочник.ПодборкиСУЗ).ЭтоТест
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоТест,
		|	ВЫБОР
		|		КОГДА СодержаниеСУЗ.СсылкаНаЭлемент ССЫЛКА Справочник.РесурсыСУЗ
		|			ТОГДА ВЫРАЗИТЬ(СодержаниеСУЗ.СсылкаНаЭлемент КАК Справочник.РесурсыСУЗ).SCO
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоSCO,
		|	СодержаниеСУЗ.Владелец КАК ЭлектронныйРесурс,
		|	СодержаниеСУЗ.Ссылка КАК ЭлементСодержания
		|ПОМЕСТИТЬ ВыборкаЭлементовСодержания
		|ИЗ
		|	Справочник.СодержаниеСУЗ КАК СодержаниеСУЗ
		|ГДЕ
		|	СодержаниеСУЗ.ЭтоГруппа = ЛОЖЬ
		|	И СодержаниеСУЗ.ПометкаУдаления = ЛОЖЬ
		|	И СодержаниеСУЗ.Владелец В(&МассивЭлектронныхРесурсов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВыборкаЭлементовСодержания.ЭлектронныйРесурс КАК ЭлектронныйРесурс,
		|   ИСТИНА КАК ВыставляетсяОценка
		|ИЗ
		|	ВыборкаЭлементовСодержания КАК ВыборкаЭлементовСодержания
		|ГДЕ
		|	((ВыборкаЭлементовСодержания.ЭтоТест = ИСТИНА
		|				И ВыборкаЭлементовСодержания.НазначениеТестирования = &НазначениеТестированияАттестация)
		|			ИЛИ ВыборкаЭлементовСодержания.ЭтоSCO = ИСТИНА)";

	Запрос.УстановитьПараметр("МассивЭлектронныхРесурсов", МассивЭлектронныхРесурсов);
	Запрос.УстановитьПараметр("НазначениеТестированияАттестация", Перечисления.НазначенияТестированийСУЗ.Аттестация);
	
	Результат = Запрос.Выполнить();
	
	ТаблицаЭлектронныхРесурсов = Результат.Выгрузить();
	
	Для каждого ЭлектронныйРесурс Из МассивЭлектронныхРесурсов Цикл
	
		Если ТаблицаЭлектронныхРесурсов.Найти(ЭлектронныйРесурс, "ЭлектронныйРесурс") = Неопределено Тогда
			НоваяСтрока = ТаблицаЭлектронныхРесурсов.Добавить();
			НоваяСтрока.ЭлектронныйРесурс = ЭлектронныйРесурс;
			НоваяСтрока.ВыставляетсяОценка = Ложь;
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат ТаблицаЭлектронныхРесурсов;
	
КонецФункции

//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//

// ВЕБ-КАБИНЕТ

Функция ТаблицаЭлектронныхРесурсовДляДанныхВебКабинета() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СводыЗнанийСУЗ.Ссылка,
		|	СводыЗнанийСУЗ.Родитель,
		|	СводыЗнанийСУЗ.ЭтоГруппа КАК ЭтоГруппа,
		|	СводыЗнанийСУЗ.Наименование КАК Наименование,
		|	СводыЗнанийСУЗ.ДатаИзменения,
		|	СводыЗнанийСУЗ.Тип
		|ИЗ
		|	Справочник.СводыЗнанийСУЗ КАК СводыЗнанийСУЗ
		|ГДЕ
		|	СводыЗнанийСУЗ.ПометкаУдаления = ЛОЖЬ
		|	И СводыЗнанийСУЗ.Предопределенный = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	СводыЗнанийСУЗ.ЭтоГруппа УБЫВ,
		|	СводыЗнанийСУЗ.Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

// Обновляет данные веб-кабинета пользователя, которые не обновляются "пообъектно"
//
Процедура ОбновитьДанныеВебКабинета(Пользователь, ТаблицаЭлектронныхРесурсов = Неопределено) Экспорт

	УстановитьПривилегированныйРежим(Истина);		
	
	// Удаляем старые данные
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ИдентификаторПользователяИБ")
	);
	
	Если ПравоДоступа("Просмотр", Метаданные.Справочники.СводыЗнанийСУЗ, ПользовательИБ) Тогда
		
		// Получаем данные
		//
		
		Если ТаблицаЭлектронныхРесурсов = Неопределено Тогда
			ТаблицаЭР = ТаблицаЭлектронныхРесурсовДляДанныхВебКабинета();
		Иначе
			ТаблицаЭР = ТаблицаЭлектронныхРесурсов.Скопировать();
		КонецЕсли;
		
		Если ОбъектыСУЗПовтИсп.ИспользуютсяОграниченияНаДоступКЭлектроннымКурсам() Тогда
		
			// Удаляем недоступные электронные ресурсы
				
			Сч = ТаблицаЭР.Количество();

			Пока Сч > 0 Цикл			
				
				ТекСтрока = ТаблицаЭР[Сч - 1];

				Если НЕ УправлениеДоступом.ЕстьРоль("ЭлектронныеРесурсыПросмотрКаталогаСУО", ТекСтрока.Ссылка, Пользователь) Тогда //--# КК: ЗАМЕНИТЬ РОЛЬ НА "УченикКК"
					ТаблицаЭР.Удалить(Сч - 1);		
				КонецЕсли;
				
				Сч = Сч - 1;
				
			КонецЦикла;
			
		КонецЕсли;		
		
		// Записываем данные
		//
		
		РегистрыСведений.ДанныеВебКабинетаСУЗ_ПН.ДобавитьДанные(
			Пользователь,
			Перечисления.ТипыДанныхВебКабинетаСУЗ.КаталогЭлектронныхРесурсов,
			Пользователь,
			ОбщегоНазначенияСУ.ДанныеВJSON(ТаблицаЭР),
			Перечисления.ФорматыВебДанныхСУ.json);	
			
		// Записываем зависимости	
		//
		
		МассивЭлектронныхРесурсов = ТаблицаЭР.ВыгрузитьКолонку("Ссылка");	
		
		РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.ДобавитьДанные(Пользователь, "Справочник.СводыЗнанийСУЗ", МассивЭлектронныхРесурсов);	
		
	Иначе
		
		РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.УдалитьДанные(Пользователь, "Справочник.СводыЗнанийСУЗ");
		РегистрыСведений.ДанныеВебКабинетаСУЗ_ПН.УдалитьДанные(Пользователь, Перечисления.ТипыДанныхВебКабинетаСУЗ.КаталогЭлектронныхРесурсов, Пользователь);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьДанныеВебКабинетаДляВсехПользователей(ТаблицаЭлектронныхРесурсов = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ ВебКабинетСУ.Используется() Тогда
		Возврат;
	КонецЕсли;	
	
	Если ТаблицаЭлектронныхРесурсов = Неопределено Тогда
		ТаблицаЭлектронныхРесурсов = Справочники.СводыЗнанийСУЗ.ТаблицаЭлектронныхРесурсовДляДанныхВебКабинета();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПользователиВебКабинетаСУ.Пользователь,
		|	ПользователиВебКабинетаСУ.Пользователь.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ
		|ИЗ
		|	РегистрСведений.ПользователиВебКабинетаСУ КАК ПользователиВебКабинетаСУ";
			
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивПользователей = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
			ВыборкаДетальныеЗаписи.ИдентификаторПользователяИБ
		);
		
		Если НЕ ПравоДоступа("Просмотр", Метаданные.Справочники.СводыЗнанийСУЗ, ПользовательИБ) Тогда
			Продолжить; // Нельзя смотреть каталог, поэтому данные не нужны
		КонецЕсли;
		
		МассивПользователей.Добавить(ВыборкаДетальныеЗаписи.Пользователь);
		
	КонецЦикла;		
	
	ПараметрыФЗ = Новый Массив;
	ПараметрыФЗ.Добавить(МассивПользователей);
	ПараметрыФЗ.Добавить(ТаблицаЭлектронныхРесурсов);
	
	ВебКабинетСУ.ДобавитьЗаданиеНаОбновлениеДанных(ОбщегоНазначения.ИмяТаблицыПоСсылке(Справочники.СводыЗнанийСУЗ.ПустаяСсылка()), "ВебКабинетСУ.ОбновитьДанныеОбъекта", ПараметрыФЗ, "СводыЗнанийСУЗ.ОбновитьДанныеВебКабинетаДляВсехПользователей");
	
КонецПроцедуры

//----------------------------------//

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("Тип");

КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = "%2 ""%1""";
	
	Представление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Представление, Данные.Наименование, Данные.Тип);

КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		
		Если Параметры.Свойство("Ключ") И НЕ ПравоДоступа("Изменение", Метаданные.Справочники.СводыЗнанийСУЗ) Тогда
			
			СтандартнаяОбработка = Ложь;			
			Параметры.Вставить("СводЗнаний", Параметры.Ключ);			
			ВыбраннаяФорма = "ОбщаяФорма.ОбозревательОбъектовСУЗ";			
			Возврат; // Просмотр курса
			
		КонецЕсли;
		
		Если Параметры.Свойство("Ключ")
			ИЛИ Параметры.Свойство("ЭтоГруппа")
			ИЛИ Параметры.Свойство("ЗначениеКопирования") Тогда
			
			Если Параметры.Свойство("Ключ") И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Ключ, "Тип") = Перечисления.ТипыЭлектронныхРесурсовСУЗ.Тест Тогда
				СтандартнаяОбработка = Ложь;						
				Параметры.Вставить("ЭлектронныйРесурс", Параметры.Ключ);
				Параметры.Ключ = Справочники.СводыЗнанийСУЗ.Тест(Параметры.Ключ);					
				ВыбраннаяФорма = "Справочник.ПодборкиСУЗ.Форма.ФормаТеста";						
				Возврат;
			КонецЕсли;
			
			Возврат; // Форма курса	
			
		Иначе
			
			Если Параметры.Свойство("ЗначенияЗаполнения") И Параметры.ЗначенияЗаполнения.Свойство("Тип") Тогда					
				
				Если Параметры.ЗначенияЗаполнения.Тип = Перечисления.ТипыЭлектронныхРесурсовСУЗ.Тест Тогда
					
					СтандартнаяОбработка = Ложь;						
					Параметры.Вставить("СоздатьЭлектронныйРесурс", Истина);						
					ВыбраннаяФорма = "Справочник.ПодборкиСУЗ.Форма.ФормаТеста";						
					Возврат; // Создание теста
					
				КонецЕсли;
				
				Если Параметры.ЗначенияЗаполнения.Тип = Перечисления.ТипыЭлектронныхРесурсовСУЗ.ЭлектронныйКурс Тогда
					
					СтандартнаяОбработка = Ложь;						
					Параметры.Вставить("СоздатьЭлектронныйРесурс", Истина);						
					ВыбраннаяФорма = "Справочник.СводыЗнанийСУЗ.ФормаОбъекта";						
					Возврат; // Создание курса
					
				КонецЕсли;
				
			Иначе
				
				СтандартнаяОбработка = Ложь;					
				ВыбраннаяФорма = "ФормаСоздания";					
				Возврат; // Форма создания
				
			КонецЕсли;
			
			
		КонецЕсли;			
						
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
